TOERH/app/controllers/admin_controller.rb

SELECT "api_keys".* FROM "api_keys"
---
	def index
		@apiKeys = ApiKey.all

SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."id" = 1 LIMIT 1
DELETE FROM "api_keys" WHERE "api_keys"."id" = ?  [["id", 1]]
---
	def destroy
		apiKey = ApiKey.where(:id => params[:id]).take
		apiKey.destroy