TOERH/app/controllers/api_key_controller.rb

	def generate
		apiKey = SecureRandom.hex(10)
		email = params[:email]

		if ApiKey.where(:email => email).present?
			flash[:error] = "This email has already been registerd"
			return redirect_to :back
		end

		apiKey = ApiKey.create(apiKey: apiKey, email: email)
---
SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."email" = 'matthis@me.com' LIMIT 1
SELECT 1 AS one FROM "api_keys" WHERE ("api_keys"."email" = 'matthis@me.com' AND "api_keys"."id" != 24) LIMIT 1
INSERT INTO "api_keys" ("api_key", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?)  [["api_key", "13c3f643716b7803bd43"], ["created_at", Tue, 11 Feb 2014 16:43:00 UTC +00:00], ["email", "matthis@me.com"], ["updated_at", Tue, 11 Feb 2014 16:43:00 UTC +00:00]]