TOERH/app/controllers/auth_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."email" = 'matthis@me.com' LIMIT 1
---
	def login
		admin = Admin.where(:email => params[:email]).take