TOERH/app/controllers/api/v1/licences_controller.rb

	def show
		licence = Licence.where(licence_id: params[:id]).take!
---
SELECT "licences".* FROM "licences" WHERE "licences"."licence_id" = '3b212465a13ac965f2593bf2' LIMIT 1