TOERH/app/controllers/api/v1/resources_controller.rb

SELECT "resources".* FROM "resources" WHERE "resources"."user_id" = 40 ORDER BY "resources"."id" DESC LIMIT 25 OFFSET 0
SELECT "resources".* FROM "resources" WHERE (name like '%min%') ORDER BY "resources"."id" DESC LIMIT 25 OFFSET 0
SELECT "resources".* FROM "resources" WHERE (name like '%min%')
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "resources" WHERE "resources"."user_id" = 40 LIMIT 25 OFFSET 0) subquery_for_count
---
	def index
		limit = params[:limit] || 25
		offset = params[:offset] || 0

		if params[:user_id]
			resources = Resource.limit(limit).offset(offset).order(id: :desc).where(user_id: params[:user_id])
		else
			resources = Resource.limit(limit).offset(offset).order(id: :desc)
		end

		if resources
			data = resources.map do |resource|
				format_data(resource)
			end

			result = {
				status: 200,
				message: 'All resources',
				count: resources.count,
			 	items: data,
			 	rels: {

SELECT "resources".* FROM "resources" WHERE "resources"."resource_id" = '7eb31103f50360cd3b458bb4' LIMIT 1
---
	def show
		resource = Resource.where(resource_id: params[:id]).take!

SELECT "resources".* FROM "resources" WHERE "resources"."resource_id" = '827c6958dad88b425daff9a9' LIMIT 1
---
	def update
		resource = Resource.where(resource_id: params[:id]).take!

SELECT "resources".* FROM "resources" WHERE "resources"."resource_id" = '7eb31103f50360cd3b458bb4' LIMIT 1
DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 1]]
---
	def destroy
		resource = Resource.where(resource_id: params[:id]).take!

		resource.destroy