TOERH/app/controllers/api/v1/resourcetypes_controller.rb

	def index
		limit = params[:limit] || 25
		offset = params[:offset] || 0

		resourceTypes = ResourceType.limit(limit).offset(offset).order(id: :desc)

		data = resourceTypes.map do |resourceType|
			format_data(resourceType)
		end

		result = {
			status: 200,
			message: 'All users',
			count: resourceTypes.count,
			items: data,
			rels: {
---
SELECT "resource_types".* FROM "resource_types" ORDER BY "resource_types"."id" DESC LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "resource_types" LIMIT 25 OFFSET 0) subquery_for_count