TOERH/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "users" LIMIT 25 OFFSET 0) subquery_for_count
---
	def index
		limit = params[:limit] || 25
		offset = params[:offset] || 0

		users = User.limit(limit).offset(offset).order(id: :desc)

		if users.count > 0

SELECT "users".* FROM "users" WHERE "users"."user_id" = '40d96ce820d4036b1567f7d7' LIMIT 1
---
	def show
		user = User.where(user_id: params[:id]).take!

SELECT "users".* FROM "users" WHERE "users"."user_id" = 'c11b6faca37ac82908c43850' LIMIT 1
---
	def update
		user = User.where(user_id: params[:id]).take!

SELECT "users".* FROM "users" WHERE "users"."user_id" = 'c11b6faca37ac82908c43850' LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
	def destroy
		user = User.where(user_id: params[:id]).take!
		user.destroy