app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'matthis@me.com' LIMIT 1
---
	def authenticate
		userAuth = TOERH::UserAuth.new

		begin
			user = userAuth.get_authenticated_user(params[:email], params[:password])

			result = {
				status: 200,
				message: 'Authentication successful',
				access_token: user.access_token,
				user: {
					user_id: user.user_id,
					firstname: user.firstname,
					surname: user.surname,
					email: user.email,
				}